In [8]:
import numpy as np
import pandas as pd

In [9]:
pd.read_csv('ex.csv')

   1   2   3   4
0  5   6   7   8
1  9  10  11  12

In [14]:
names = ['a','b','c','d','message']
pd.read_csv('csv/ex.csv',names = names)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12  pandas

In [16]:
names = ['a','b','c','d','message']
pd.read_csv('csv/ex.csv',names = names, index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
pandas   9  10  11  12

In [33]:
parsed = pd.read_csv('csv/csv_min.csv', index_col=['key1','key2'])

In [34]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [37]:
ex7 = pd.read_table("csv/ex7.csv")

In [38]:
ex7

       a,"b","c"
0      1,"2","3"
1  1,"2","3","4"

In [39]:
import csv
f = open('csv/ex7.csv')
f

In [40]:
reader = csv.reader(f)

for i in reader:
    print(i)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3', '4']

In [42]:
lines = list(csv.reader(open('csv/ex7.csv')))
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3', '4']]

In [43]:
header, values = lines[0], lines[1:]
header
values

[['1', '2', '3'], ['1', '2', '3', '4']]

### 이진데이터 형식

In [49]:
frame = pd.read_csv('csv/ex.csv', names=['a','b','c','d','message'])
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12  pandas

In [54]:
frame.to_pickle('csv/frame_pickle')

In [55]:
pd.read_pickle('csv/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12  pandas

###  hd5

In [57]:
store = pd.HDFStore('csv/mydata.h5')

In [59]:
store['obj1'] = frame
store['obj1_col'] = frame['a']

In [61]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: csv/mydata.h5

In [64]:
store['obj1']

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12  pandas

### 데이터베이스와 사용하기

In [65]:
import sqlite3
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('mydata.sqlite')
con.execute(query)
con.commit()

In [66]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [68]:
cursor = con.execute('select * from test')

rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [69]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [70]:
pd.DataFrame(rows, columns = list(zip(*cursor.description))[0])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [72]:
import pandas.io.sql as sql

pd.read_sql('select * from test', con)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [73]:
con

In [74]:
from pandas import Series, DataFrame

import pandas as pd
import numpy as np

df1 = DataFrame({'key': ['b','b','a','c','a','a','b'],
                'data1':range(7)})
df2 = DataFrame({'key': ['a','b','d'], 'data2':range(3)})

In [77]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [78]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [79]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [80]:
pd.merge(df1,df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [81]:
df3 = DataFrame({'lkey': ['b','b','a','c','a','a','b'],
                'data3':range(7)})
df4 = DataFrame({'rkey': ['a','b','d'], 'data4':range(3)})
pd.merge(df3,df4, left_on='lkey', right_on='rkey')

  lkey  data3 rkey  data4
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [82]:
left = DataFrame({'key': ['a','b','a','a','b','c',],
                 'value':range(6)})
right = DataFrame({'group_val':[3.5, 7] }, index =['a','b'])

In [83]:
left

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [84]:
right

   group_val
a        3.5
b        7.0

In [86]:
pd.merge(left,right, left_on = 'key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [87]:
pd.merge(left,right, left_on = 'key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

## 양측이 색인

In [88]:
left2 = DataFrame([[1,2], [3,4], [5,6]], index=['a','c','e'], columns=['Ohio','Nevada'])
right2 = DataFrame([[7,8], [9,10], [11,12], [13,14]], index=['b','c','d','e'], columns=['Missouri','Alabama'])

In [89]:
left2

   Ohio  Nevada
a     1       2
c     3       4
e     5       6

In [90]:
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [93]:
pd.merge(left2, right2, left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
c     3       4         9       10
e     5       6        13       14

In [94]:
pd.merge(left2, right2, left_index=True, right_index=True, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [96]:
left2.join(right2)

   Ohio  Nevada  Missouri  Alabama
a     1       2       NaN      NaN
c     3       4       9.0     10.0
e     5       6      13.0     14.0

In [97]:
left2.join(right2, how="outer")

NameError: name 'outer' is not defined